nxp-appcodehub/an-lpc553x-dual-servo-motor-control/boards/dual_servo/pin_mux.c
                         /* Signal(function) select: PORT010 (pin 21) is configured as ADC0_1A. */
                         | IOCON_PIO_FUNC(0x00u)

                         /* Select Digital mode: Disable digital mode.
                          * Digital input set to 0. */
                         | IOCON_PIO_DIGIMODE(PIO0_10_DIGIMODE_ANALOG));

    IOCON->PIO[0][15] = ((IOCON->PIO[0][15] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Signal(function) select: PORT015 (pin 22) is configured as ADC0_3A. */
                         | IOCON_PIO_FUNC(0x00u)

                         /* Select Digital mode: Disable digital mode.
                          * Digital input set to 0. */
                         | IOCON_PIO_DIGIMODE(PIO0_15_DIGIMODE_ANALOG));

    IOCON->PIO[0][16] = ((IOCON->PIO[0][16] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Signal(function) select: PORT016 (pin 20) is configured as ADC0_3B. */
                         | IOCON_PIO_FUNC(0x00u)

                         /* Select Digital mode: Disable digital mode.
                          * Digital input set to 0. */
                         | IOCON_PIO_DIGIMODE(PIO0_16_DIGIMODE_ANALOG));

    IOCON->PIO[0][23] =
        ((IOCON->PIO[0][23] &
          /* Mask bits to zero which are setting */
          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_ASW0_MASK)))

         /* Signal(function) select: PORT023 (pin 19) is configured as ADC0_8B. */
         | IOCON_PIO_FUNC(0x00u)

         /* Mode select (on-chip pull-up/pull-down resistor control): Inactive.
          * Inactive (no pull-down/pull-up resistor enabled). */
         | IOCON_PIO_MODE(PIO0_23_MODE_INACTIVE)

         /* Select Digital mode: Disable digital mode.
          * Digital input set to 0. */
         | IOCON_PIO_DIGIMODE(PIO0_23_DIGIMODE_ANALOG)

         /* Analog switch input control: Analog switch is closed.
          * (enable). */
         | IOCON_PIO_ASW0(PIO0_23_ASW0_ENABLE));

    IOCON->PIO[1][19] = ((IOCON->PIO[1][19] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Signal(function) select: PORT119 (pin 30) is configured as ADC0_4B. */
                         | IOCON_PIO_FUNC(0x00u)

                         /* Select Digital mode: Disable digital mode.
                          * Digital input set to 0. */
                         | IOCON_PIO_DIGIMODE(PIO1_19_DIGIMODE_ANALOG));
    IOCON->PIO[0][31] =
        ((IOCON->PIO[0][31] &
          /* Mask bits to zero which are setting */
          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_ASW0_MASK)))

         /* Signal(function) select: PORT031 (pin 23) is configured as ADC0_8A. */
         | IOCON_PIO_FUNC(0x00u)

         /* Mode select (on-chip pull-up/pull-down resistor control): Inactive.
          * Inactive (no pull-down/pull-up resistor enabled). */
         | IOCON_PIO_MODE(PIO0_31_MODE_INACTIVE)

         /* Select Digital mode: Disable digital mode.
          * Digital input set to 0. */
         | IOCON_PIO_DIGIMODE(PIO0_31_DIGIMODE_ANALOG)

         /* Analog switch input control: Analog switch is closed.
          * (enable). */
         | IOCON_PIO_ASW0(PIO0_31_ASW0_ENABLE));
}
void BOARD_InitADC1(void)
{
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t gpio0_pin9_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_11 (pin 9)  */
    GPIO_PinInit(GPIO, 0U, 11U, &gpio0_pin9_config);

    gpio_pin_config_t gpio0_pin10_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_12 (pin 10)  */
    GPIO_PinInit(GPIO, 0U, 12U, &gpio0_pin10_config);

    gpio_pin_config_t gpio1_pin4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_7 (pin 4)  */
    GPIO_PinInit(GPIO, 1U, 7U, &gpio1_pin4_config);
    
    gpio_pin_config_t gpio0_pin1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_1 (pin 5)  */
    GPIO_PinInit(GPIO, 0U, 1U, &gpio0_pin1_config);

    IOCON->PIO[0][11] = ((IOCON->PIO[0][11] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Signal(function) select: PORT011 (pin 9) is configured as ADC1_2A. */
                         | IOCON_PIO_FUNC(0x00u)

                         /* Select Digital mode: Disable digital mode.
                          * Digital input set to 0. */
                         | IOCON_PIO_DIGIMODE(PIO0_11_DIGIMODE_ANALOG));

    IOCON->PIO[0][12] = ((IOCON->PIO[0][12] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Signal(function) select: PORT012 (pin 10) is configured as ADC1_3A. */
                         | IOCON_PIO_FUNC(0x00u)

                         /* Select Digital mode: Disable digital mode.
                          * Digital input set to 0. */
                         | IOCON_PIO_DIGIMODE(PIO0_12_DIGIMODE_ANALOG));

    IOCON->PIO[1][7] = ((IOCON->PIO[1][7] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Signal(function) select: PORT17 (pin 4) is configured as ADC1_3B. */
                        | IOCON_PIO_FUNC(0x00u)

